Desafio17-Mejorar-Arquitectura/test/Artillery/result_sin_consoleLog.txt
Phase started: unnamed (index: 0, duration: 1s) 02:22:48(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 02:22:49(-0300)

--------------------------------------
Metrics for period to: 02:22:50(-0300) (width: 1.664s)
--------------------------------------

http.codes.200: ................................................................ 105
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 125
http.response_time:
  min: ......................................................................... 115
  max: ......................................................................... 318
  median: ...................................................................... 186.8
  p95: ......................................................................... 273.2
  p99: ......................................................................... 290.1
http.responses: ................................................................ 105
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 02:23:00(-0300) (width: 7.38s)
--------------------------------------

http.codes.200: ................................................................ 895
http.request_rate: ............................................................. 119/sec
http.requests: ................................................................. 875
http.response_time:
  min: ......................................................................... 23
  max: ......................................................................... 274
  median: ...................................................................... 147
  p95: ......................................................................... 214.9
  p99: ......................................................................... 262.5
http.responses: ................................................................ 895
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8112.3
  max: ......................................................................... 8653.1
  median: ...................................................................... 8520.7
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8520.7


All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 02:22:59(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 98/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 23
  max: ......................................................................... 318
  median: ...................................................................... 149.9
  p95: ......................................................................... 252.2
  p99: ......................................................................... 273.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8112.3
  max: ......................................................................... 8653.1
  median: ...................................................................... 8520.7
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8520.7